{
    "basics": {
      "name": "Matthew Sutton",
      "label": "Backend Software Engineer",
      "summary": "Implementing demanding features, required by both clients and systems. Attracted to performance critical elements. Interested in solving problems at scale. Employer of both KISS and Avoid Premature Optimisation. Whilst abiding to the Agile methodology.",
      "email": "hello@matthew-sutton.com",
      "image": {
        "small": "/assets/avatar_small.webp",
        "medium": "/assets/avatar_medium.webp",
        "large": "/assets/avatar_large.webp"
      },
      "phone": "",
      "website": "https://matthew-sutton.com",
      "location": {
        "address": "United Kingdom",
        "postalCode": "",
        "city": "",
        "countryCode": "",
        "region": ""
      },
      "github": {
        "username": "MS26",
        "url": "https://github.com/MS26"
      },
      "linkedin": {
        "username": "Matthew Sutton",
        "url": "https://www.linkedin.com/in/matthew-sutton-6a6466212/"
      }
    },
    "work": [
      {
        "name": "Codeweavers",
        "position": "Senior Lead Software Engineer",
        "url": "https://www.codeweavers.net",
        "startDate": "July, 2024",
        "endDate": "",
        "summary": "Transitioned into a senior lead position for the Digital Store platform, providing technical and engineering leadership while helping shape the architecture and strategy to support global scale. Working closely with leaders across Cox to align on direction and drive innovation across our companies.",
        "highlights": [
          {
            "title": "Certification",
            "description": "Leading the push for Codeweavers to gain ISO27001 certification, and putting the right processes in place to help other Cox companies follow quickly behind.",
            "display": {
              "pdf": true
            }
          },
          {
            "title": "Organisational Strategy",
            "description": "Working with our Senior Leadership Team on the planning and setup of a merger between two Cox companies, making sure teams, systems, and goals are aligned.",
            "display": {
              "pdf": true
            }
          },
          {
            "title": "Leadership",
            "description": "Leading four engineering teams across the Digital Store platform: one focused on AWS migration from our on-prem infrastructure; two leading the global rollout of our Storefront and Checkout products; and another supporting the transition work following a company merger. Supporting team growth, delivery, and alignment across all areas.",
            "display": {
              "pdf": true
            }
          },
          {
            "title": "AI Adoption",
            "description": "Working as part of a global AI Adoption Team across Cox, driving the responsible and effective use of AI within our businesses. Supporting teams in identifying opportunities to integrate AI into workflows, documenting best practices, and helping shape the strategy for how AI can accelerate innovation and productivity across the organisation.",
            "display": {
              "pdf": true
            }
          }
        ]
      },
      {
        "name": "Codeweavers",
        "position": "Lead Software Engineer",
        "url": "https://www.codeweavers.net",
        "startDate": "November, 2022",
        "endDate": "June, 2024",
        "summary": "Progressed into the lead position within the Digital Store platform, managing and planning the projects that the team backing the platform would be working on. Speaking closely to clients, ensuring all requirements were fulfilled, in a way that enhanced the platform, for not only them but all clients using it.",
        "highlights": [
          {
            "title": "Personal Highlight",
            "description": "Migrating our Frontend architecture to have all assets hosted from AWS, reducing average latency by over 1 second. Then working on the migration of our Backend to AWS, currently focusing on the update of the framework from .Net Framework 4.7 to .Net 8.",
            "display": {
              "pdf": true
            }
          },
          {
            "title": "Management",
            "description": "Taking on the responsibility of managing multiple developers within the Digital Store platform. Conducting monthly individual catchup's and ensuring the team is meeting the expected requirements. Whilst also taking an active role in recruitment.",
            "display": {
              "pdf": true
            }
          },
          {
            "title": "Communication",
            "description": "Working closely with other companies within Cox Automotive, delivering combined products to our customers. Whilst also reaching out to providers ensuring that our integrations are delivering the best service for our products.",
            "display": {
              "pdf": true
            }
          },
          {
            "title": "Tenders",
            "description": "Aiding the operations team to create and submit tenders for multiple used car locators internationally. Planning required work to ensure our products can fulfill all requirements within the time constraints.",
            "display": {
              "pdf": true
            }
          },
          {
            "title": "Internationalisation",
            "description": "Releasing our Storefront product into multiple new markets; <a href=\"https://selekt.volvocars.co.uk\" target=\"_blank\">UK</a>, <a href=\"https://selekt.volvocars.no\" target=\"_blank\">Norway</a>, <a href=\"https://selekt.volvocars.at\" target=\"_blank\">Austria</a> and many more. All using the same platform with a personalised configuration, making the site their own.",
            "display": {
              "pdf": true
            }
          }
        ]
      },
      {
        "name": "Codeweavers",
        "position": "Senior Software Engineer",
        "url": "https://www.codeweavers.net",
        "startDate": "June, 2021",
        "endDate": "October, 2022",
        "summary": "Naturally moved into a senior development role in the Digital Store platform becoming involved in ensuring it was ready for the company's expansion into Europe. Expanding my abilities into Frontend technologies, aiding with projects that span across both areas.",
        "highlights": [
          {
            "title": "Personal Highlight",
            "description": "Extending our Facet Search implementation to support counts against each available option. This required a re-architecture of the algorithm used and was done without impacting its performance.",
            "display": {
              "pdf": true
            }
          },
          {
            "title": "Tenders",
            "description": "Ensuring the platform delivered the products required by a client, quickly developing sustainable features for demonstrations to prove the platform could fulfil their requirements.",
            "display": {
              "pdf": false
            }
          },
          {
            "title": "Internationalisation",
            "description": "Developing our Storefront product to a point it was ready for an international release. Releasing it in <a href=\"https://selekt.volvocars.fr\" target=\"_blank\">France</a> first, being closely followed by another 27 markets.",
            "display": {
              "pdf": false
            }
          }
        ]
      },
      {
        "name": "Codeweavers",
        "position": "Software Engineer",
        "url": "https://www.codeweavers.net",
        "startDate": "June, 2019",
        "endDate": "May, 2021",
        "summary": "Began to work on both the production and continuous integration (CI) platform as well as continuing work on client based projects.",
        "highlights": [
          {
            "title": "Personal Highlight",
            "description": "Migrated the way one of our core applications stores and processes data, reducing its memory foot print from 13.5GB to 6GB, whilst completely removing its usage of the Large Object Heap (LOH).",
            "display": {
              "pdf": true
            }
          },
          {
            "title": "Continuous Integration",
            "description": "Increased our build throughput, developing the functionality of concurrent builds, for both related and un-related projects.",
            "display": {
              "pdf": false
            }
          },
          {
            "title": "Continuous Deployment",
            "description": "Implemented the functionality of concurrent deploys for unrelated projects. Increasing our deploys per day by 100%.",
            "display": {
              "pdf": false
            }
          },
          {
            "title": "Sustainability",
            "description": "Extended our implementation of Canary Testing to include the ability to replay requests for our core APIs during deploys and ensure the responses match within a defined tolerance.",
            "display": {
              "pdf": false
            }
          },
          {
            "title": "Data Structures",
            "description": "Modified an existing word index, used to enable free text searching, to use a Trie data structure. This reduced indexing memory consumption by over 2GB at peak working set. Then further modified the structure into a Compressed Trie data structure which reduced the node count from 477,085 to 144,229.",
            "display": {
              "pdf": false
            }
          }
        ]
      },
      {
        "name": "Codeweavers",
        "position": "Placement Software Engineer",
        "url": "https://www.codeweavers.net",
        "startDate": "June, 2017",
        "endDate": "May, 2019",
        "summary": "Spent the 3rd year of my degree at The University of Derby as a placement student at Codeweavers.",
        "highlights": [
          {
            "title": "Personal Highlight",
            "description": "Being offered a full-time role in the first half of my placement, with the final year of my degree funded.",
            "display": {
              "pdf": true
            }
          },
          {
            "title": "Professional Development",
            "description": "Delivered a JLR project to help the upsell of Stock vehicles during a Build to Order journey. This was fundamental to me growing my confidence and understanding the complete journey of a project.",
            "display": {
              "pdf": false
            }
          }
        ]
      }
    ],
    "clients": [
      "Volvo",
      "Novuna",
      "Hendy",
      "Auto Trader",
      "Mercedes-Benz",
      "BMW",
      "Mini",
      "Stellantis",
      "Toyota",
      "Lexus",
      "JLR"
    ],
    "skills": [
      "C#",
      ".NET",
      "TypeScript",
      "Angular",
      "Cassandra",
      "Postgres",
      "AWS",
      "GCP",
      "Terraform",
      "Docker"
    ],
    "education": [
      {
        "institution": "University of Derby",
        "url": "https://www.derby.ac.uk",
        "area": "Computer Science",
        "studyType": "Bachelor of Science Honours Degree",
        "startDate": "September, 2015",
        "endDate": "May, 2019",
        "score": "First"
      },
      {
        "institution": "Halesowen College",
        "url": "https://www.halesowen.ac.uk",
        "area": "Computing and Systems Development",
        "studyType": "Higher National Diploma",
        "startDate": "September, 2013",
        "endDate": "May, 2015",
        "score": "Distinction* Distinction* Distinction*"
      }
    ],
    "awards": [],
    "certificates": [],
    "publications": [],
    "languages": [],
    "interests": [],
    "references": [],
    "projects": [
      {
        "name": "Serve My Site",
        "description": "Building a self-serve hosting platform for Web Applications. Focusing on providing immediate deployments and next level performance when serving the hosted applications. Currently hosting my Portfolio and other personal projects.",
        "url": "https://servemy.site",
        "github_url": "https://github.com/servemy-site",
        "keywords": [
          "C#",
          ".NET",
          "Cassandra",
          "AWS",
          "Terraform"
        ]
      },
      {
        "name": "Portfolio",
        "description": "Designing, building and hosting my portfolio site. Using the skills I've developed during my professional career to do so.",
        "url": "https://matthew-sutton.com",
        "github_url": "https://github.com/MS26/Portfolio",
        "keywords": [
          "TypeScript",
          "Angular",
          "AWS",
          "Terraform"
        ]
      },
      {
        "name": "Word Processing",
        "description": "Attempting to reduce memory allocations during word processing.",
        "url": null,
        "github_url": "https://github.com/MS26/SpanIt",
        "keywords": [
          "C#",
          ".NET"
        ]
      },
      {
        "name": "Word Indexing",
        "description": "Attempting to reduce memory allocations and un-lock new natural language search features during word indexing.",
        "url": null,
        "github_url": "https://github.com/MS26/TrieIt",
        "keywords": [
          "C#",
          ".NET"
        ]
      }
    ]
  }